{"projects":
    [
        {"id": 0,
         "project_name": "The Random Quote Generator",
         "description": "This project is meant to show the reader either a random office quote or a random inspiration quote based off of which button they press. Also, if they wait long enough without pressing a button, they will be shown a random quote of that same section.",
         "technologies": ["JavaScript", "HTML", "CSS"],
         "live_link": "https://sdounchis.github.io/U1-Project/u1proj.html",
         "github_link": "https://github.com/sdounchis/U1-Project",
         "project_thumbnail": "/static/images/proj1.jpg",
         "image_urls": ["/static/images/proj1.1.jpg",
           "/static/images/proj1.2.jpg"]
        },
        {"id": 1,
         "project_name": "Dynamic Web Page: Student Search",
         "description": "In this project, we are using javascript to turn a static html page of student names into a website with a search bar and different pages each showing 10 different students.",
         "technologies": ["JavaScript", "HTML", "CSS"],
         "live_link": "https://sdounchis.github.io/U2-Project/jjj.html",
         "github_link": "https://github.com/sdounchis/U2-Project",
         "project_thumbnail": "/static/images/proj2.jpg",
         "image_urls": ["/static/images/proj2.1.jpg",
           "/static/images/proj2.2.jpg"]
        },
        {"id": 2,
         "project_name": "Interactive Conference Sign-Up Form",
         "description": "In this project, I used javascript to alter an HTML form, and make it interactive with multiple drop down menus and input selections. Additionally, I used Regex to validate credit card info, emails, and more. This project is a form for a conference in which the reader has to give basic info, select a job role, give t-shirt info, register for activities, and give payment info.",
         "technologies": ["JavaScript", "jQuery", "HTML", "CSS"],
         "live_link": "https://sdounchis.github.io/U3-Project/",
         "github_link": "https://github.com/sdounchis/U3-Project",
         "project_thumbnail": "/static/images/proj3.jpg",
         "image_urls": ["/static/images/proj3.1.jpg",
           "/static/images/proj3.2.jpg"]
        },
        {"id": 3,
         "project_name": "The NFL Phrase Hunter Game Show",
         "description": "In this project, the first page displays the title of the game and a start game button. Clicking this button takes you to a page in which a random NFL phrase is chosen. By clicking buttons with letters or clicking keys with the same letters, the player can check whether or not the letter is in the phrase. If so, the letter appears and the button respective to that letter turns green. If not, button respective to that letter turns red, you lose a strike, so one red strike turns into an empty strike. If a player finishes the phrase before all strikes are gone (5 wrong guesses), a win screen appears with a win message and a win picture. If a player doesn't finish the phrase before all strikes are gone (5 wrong guesses), a lose screen appears with a lose message and a lose picture. Both the win and lose pages have a start game button that reset the game to a new NFL game with a random phrase.",
         "technologies": ["JavaScript", "jQuery", "HTML", "CSS"],
         "live_link": "https://sdounchis.github.io/U4-Project/",
         "github_link": "https://github.com/sdounchis/U4-Project",
         "project_thumbnail": "/static/images/proj4.jpg",
         "image_urls": ["/static/images/proj4.1.jpg",
           "/static/images/proj4.2.jpg"]
        },
        {"id": 4,
         "project_name": "Employee Startup Directory",
         "description": "In this project, I used online, public APIs and fetching that I learned earlier in the lesson to create a functioning employee directory that loads 12 fictional, random American people while also providing various information such as their name, gender, date of birth, location, and email. On the webpage, 12 people are displayed in a grid-like format, showing name, email, and location. Once you click on one of the cards containing a person, a modal is opened which tells more information about the person such as their number, birthday, and address. Three buttons are on the modal window: the X button, the prev button, and the next button. The X button closes the modal. The prev button toggles to the previous person. The next button toggles to the final person. In addition, using the search bar at the top right corner of the screen, users can dynamically search by name in a case-insensitive manner.",
         "technologies": ["JavaScript", "JSON", "API", "HTML", "CSS"],
         "live_link": "https://sdounchis.github.io/U5-Project/",
         "github_link": "https://github.com/sdounchis/U5-Project",
         "project_thumbnail": "/static/images/proj5.jpg",
         "image_urls": ["/static/images/proj5.1.jpg",
           "/static/images/proj5.2.jpg"]
        },
        {"id": 5,
         "project_name": "Project Portfolio",
         "description": "In this project, I combined javascript, CSS, PUG, and JSON to create a web page that displays all of my unit projects from this year in Advanced Topics Web Development. On the left of the page is a picture of me and a short bio. This bio includes an link to an about page which has a longer bio, a list of my skills, and my contact info. On the right of the web page are six projects which can be clicked on. This will pull up two more pictures of the projects, a short description of the projects, the technologies used, a live link for the project, and a github repository link.",
         "technologies": ["JavaScript", "JSON", "PUG", "CSS"],
         "live_link": "https://sdounchis.github.io/U5-Project/",
         "github_link": "https://github.com/sdounchis/U5-Project",
         "project_thumbnail": "/static/images/proj6.jpg",
         "image_urls": ["/static/images/proj6.1.jpg",
           "/static/images/proj6.2.jpg"]
        }
    ]
}